In [19]:
import sqlite3
import pandas as pd
import seaborn as sns

In [2]:
conn = sqlite3.connect("titanic.db")
curs = conn.cursor()
curs.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(curs.fetchall())

[('titanic',)]

In [3]:
query = "SELECT * FROM titanic"
df = pd.read_sql_query(query, conn)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,None,S

### a. What is the average age of passengers who survived? Group the data by Sex. Display only the column Sex, AverageAge

In [4]:
curs.execute("SELECT Sex, AVG(Age) FROM titanic WHERE Survived= 1 GROUP BY Sex")
curs.fetchall()

[('female', 28.84771573604061), ('male', 27.276021505376345)]

### b. What is the percentage of passengers who survived in each Passenger Class or Pclass? Group the data by Sex. Display Pclass, Sex, percentage value.

In [5]:
curs.execute("SELECT Pclass,Sex, AVG(Survived=1)*100 FROM titanic GROUP BY Pclass, Sex")
curs.fetchall()

[('1', 'female', 96.80851063829788),
 ('1', 'male', 36.885245901639344),
 ('2', 'female', 92.10526315789474),
 ('2', 'male', 15.74074074074074),
 ('3', 'female', 50.0),
 ('3', 'male', 13.544668587896252)]

### c. What is the average age of all the passenger (survived and not survived)? Group the data by Pclass, Sex, Survived. After that use seaborn to generate a line plot to show average age vs pclass, facet by sex and color it by survived

In [18]:
curs.execute("SELECT AVG(Age) FROM titanic")
curs.fetchall()

[(29.69911764705882,)]

In [24]:
curs.execute("SELECT Pclass, Sex, Survived, AVG(Age) FROM titanic GROUP BY Pclass, Sex, survived")
curs.fetchall()

[('1', 'female', '0', 25.666666666666668),
 ('1', 'female', '1', 34.9390243902439),
 ('1', 'male', '0', 44.58196721311475),
 ('1', 'male', '1', 36.248000000000005),
 ('2', 'female', '0', 36.0),
 ('2', 'female', '1', 28.080882352941178),
 ('2', 'male', '0', 33.36904761904762),
 ('2', 'male', '1', 16.022),
 ('3', 'female', '0', 23.818181818181817),
 ('3', 'female', '1', 19.329787234042552),
 ('3', 'male', '0', 27.25581395348837),
 ('3', 'male', '1', 22.274210526315787)]

### d. What is the name, age, sex and pclass of the 5 oldest and 5 youngest persons who died?

In [20]:
curs.execute("SELECT Name, Age, Sex, Pclass FROM titanic WHERE AGE IS NOT NULL AND SURVIVED=0 ORDER BY CAST(Age AS INSIGNED) ASC LIMIT 5")
curs.fetchall()

[('Panula, Master. Eino Viljami', '1', 'male', '3'),
 ('Goodwin, Master. Sidney Leonard', '1', 'male', '3'),
 ('Palsson, Master. Gosta Leonard', '2', 'male', '3'),
 ('Rice, Master. Eugene', '2', 'male', '3'),
 ('Andersson, Miss. Ellis Anna Maria', '2', 'female', '3')]

In [16]:
curs.execute("SELECT Name, Age, Sex, Pclass FROM titanic WHERE AGE IS NOT NULL AND SURVIVED=0 ORDER BY CAST(Age AS INSIGNED) DESC LIMIT 5")
curs.fetchall()

[('Svensson, Mr. Johan', '74', 'male', '3'),
 ('Goldschmidt, Mr. George B', '71', 'male', '1'),
 ('Artagaveytia, Mr. Ramon', '71', 'male', '1'),
 ('Connors, Mr. Patrick', '70.5', 'male', '3'),
 ('Mitchell, Mr. Henry Michael', '70', 'male', '2')]

### e. On average which Passenger Class is more expensive?

In [7]:
curs.execute("SELECT Pclass, AVG(Fare) FROM titanic GROUP BY Pclass")
curs.fetchall()

[('1', 84.15468749999992), ('2', 20.66218315217391), ('3', 13.675550101832997)]